app/controllers/comments_controller.rb

  def create
    # Comment.create(text: params[:text], tweet_id: params[:tweet_id], user_id: current_user.id)

    # Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)

    @comment = Comment.create(text: comment_params[:text], tweet_id: comment_params[:tweet_id], user_id: current_user.id)
---
INSERT INTO `comments` (`user_id`, `tweet_id`, `text`, `created_at`, `updated_at`) VALUES (1, 12, 'しばらく見ていない', '2018-11-28 10:28:54', '2018-11-28 10:28:54')