app/controllers/tweets_controller.rb

  def index
    @tweets = Tweet.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `tweets`.* FROM `tweets` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 2)

  def create
    Tweet.create(image: tweet_params[:image], text: tweet_params[:text], user_id: current_user.id)
---
INSERT INTO `tweets` (`name`, `text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('yamamoto', 'test2', '', '2018-11-27 10:48:41', '2018-11-27 10:48:41', 1)

  def destroy
    tweet = Tweet.find(params[:id])
    tweet.destroy if tweet.user_id == current_user.id
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
DELETE FROM `tweets` WHERE `tweets`.`id` = 10

  def update
    tweet = Tweet.find(params[:id])
    if tweet.user_id == current_user.id
      tweet.update(tweet_params)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 12 LIMIT 1
UPDATE `tweets` SET `text` = 'のんびり月見', `updated_at` = '2018-11-28 08:13:45' WHERE `tweets`.`id` = 12

  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)
---
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 14 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 12
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1