app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 ORDER BY `users`.`id` ASC LIMIT 1
SELECT  `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `tweets` WHERE `tweets`.`user_id` = 1
---
  def show
# binding.pry
    user = User.find(params[:id])
    @nickname = current_user.nickname
      # @tweets = Tweet.where(user_id: current_user.id).page(params[:page]).per(5).order("created_at DESC")
    @tweets = user.tweets.page(params[:page]).per(5).order("created_at DESC")